## organising the data

In [23]:
import pandas as pd
import numpy as np

In [24]:
# creating list variable
name = ["Ben",  "Martin",  "Andy",  "Paul",  "Graham",  "Carina",  "Karina", "Doug", "Mark", "Zoe"]
husband = ["1973-06-21", "1970-07-16", "1949-10-08", "1969-05-24"]
wife = ["1984-11-12", "1973-08-02", "1948-11-11", "1983-07-23"]

In [25]:
# calculating difference in age
agegap = pd.to_datetime(husband) - pd.to_datetime(wife)
agegap

TimedeltaIndex(['-4162 days', '-1113 days', '331 days', '-5173 days'], dtype='timedelta64[ns]', freq=None)

In [26]:
# creating coding variables/factors
job = [1]*5 + [2]*5
job

[1, 1, 1, 1, 1, 2, 2, 2, 2, 2]

In [27]:
# creating   numeric variable
friends = [5,2,0,4,1,10,12,15,12,17]
income = [20000,40000,35000,22000,50000,5000,100,3000,10000,10]
alcohol = [10,15,20,5,30,25,20,16,17,18]
neurotic = [10,17,14,13,21,7,13,9,14,13]

In [28]:
# creating final dataframe
lecturer_data = pd.DataFrame({'friends':friends,'income':income,'alcohol':alcohol,'neurotic':neurotic, 'job':job  })
lecturer_data

   friends  income  alcohol  neurotic  job
0        5   20000       10        10    1
1        2   40000       15        17    1
2        0   35000       20        14    1
3        4   22000        5        13    1
4        1   50000       30        21    1
5       10    5000       25         7    2
6       12     100       20        13    2
7       15    3000       16         9    2
8       12   10000       17        14    2
9       17      10       18        13    2

In [29]:
lecturer_data['job'] = lecturer_data['job'].replace({1:'Lecturer', 2:'Student'})
lecturer_data

   friends  income  alcohol  neurotic       job
0        5   20000       10        10  Lecturer
1        2   40000       15        17  Lecturer
2        0   35000       20        14  Lecturer
3        4   22000        5        13  Lecturer
4        1   50000       30        21  Lecturer
5       10    5000       25         7   Student
6       12     100       20        13   Student
7       15    3000       16         9   Student
8       12   10000       17        14   Student
9       17      10       18        13   Student

In [30]:
# Missing Data, use None
neurotic  = [10,17,np.nan,13,21,7,13,9,14,np.nan]
neurotic

[10, 17, nan, 13, 21, 7, 13, 9, 14, nan]

In [31]:
# when data is missing
k = np.nanmean(neurotic)  # nanmean() function can be used to calculate the mean of array ignoring the NaN value
k

13.0